---
kind: type
id: T:Autodesk.Revit.DB.SetComparisonResult
source: html/3310a68d-b67a-79cb-ea54-deb00d9f60d9.htm
---
# Autodesk.Revit.DB.SetComparisonResult

An enumerated type listing all the relationship types between two sets of arbitrary nature.

## Syntax (C#)
```csharp
public enum SetComparisonResult
```